#+AUTHOR:      Arnaud Legrand
#+TITLE:       The $\chi^2$ test
#+DATE:        MOSIG Lecture
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :eval never-export
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}
#+LATEX_HEADER: \usepackage{commath}

#+LaTeX: \input{org-babel-document-preembule.tex}
#+LaTeX: \def\H{\ensuremath{\mathcal{H}}\xspace}
*** A biased coin
Let's assume we are given a series of $n$ coin toss. How could we
check whether the coin is biased or not ? \pause

The sample frequency of "Head" should be close to $p$ when $n$ is
large.
- $\rv{H}/n \sim \N\left(p,\sqrt{\frac{p(1-p)}{n}}\right)$ \pause
- $\boxed{\H_0: p=1/2}$ then
  $\P\left(\left|\frac{\rv{H}}{n}-1/2\right|\le\frac{1}{\sqrt{n}}\right)=95\%$. 
  \newline\null\hfill$\leadsto$ \fbox{Reject if $\not\in [0.4,0.6]$}

#+LaTeX: \small
#+begin_src R :results output :session *R* :exports both
set.seed(44); N = 100;
X=sample(x=c(0,1), size = N, prob=c(0.45,0.55), replace=T)
X
sum(X==1)/N
#+end_src

#+RESULTS:
:   [1] 0 1 1 0 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 0 1 1 1 1 1 1 0 1 0 0 0 0 1 1 0 0
:  [38] 1 0 1 1 1 0 1 1 1 1 1 1 1 1 1 1 0 0 0 0 1 0 1 1 1 0 1 0 0 1 0 0 0 0 1 1 1
:  [75] 1 1 1 1 1 0 1 0 1 1 1 1 0 1 0 0 1 1 1 0 1 1 0 0 1 1
: [1] 0.67
#+LaTeX: \normalsize

we would then correctly reject the $\H_0$ hypothesis! $\smiley$
*** A biased coin again
#+LaTeX: \small
#+begin_src R :results output :session *R* :exports both
set.seed(41); N = 100; 
X=sample(x=c(0,1), size = N, prob=c(0.45,0.55), replace=T)
sum(X==1)/N
#+end_src

#+RESULTS:
: [1] 0.51
#+LaTeX: \normalsize

If $p\approx1/2$ there is a good chance we do not detect the bias (Type II
error). $\frowny$ \pause

#+LaTeX: \small
#+begin_src R :results output :session *R* :exports both
set.seed(44); N = 100; 
X=sample(x=c(0,1), size = N, prob=c(0.5,0.5), replace=T)
sum(X==1)/N
#+end_src

#+RESULTS:
: [1] 0.61
#+LaTeX: \normalsize

We may also incorrectly reject the $\H_0$ (Type I error). $\frowny$

*** The $\chi^2$ test
- Assume we know the theoretical frequencies $p_i$
- Count the number of occurences of each category
- Compute $\rv{T} = \sum_{i=1}^k \frac{(\rv{N_i}-np_i)^2}{np_i}$
- If all the $\rv{X_j}\sim p$, then $\rv{T} \sim \chi^2_k$ and
  $\P(\rv{T}<v)=95\%$, with $v=\texttt{qchisq(p=.95,df=k)}$
  #+begin_src R :results output :session *R* :exports both
  qchisq(p=.95,df=1)
  qchisq(p=.95,df=3)
  qchisq(p=.95,df=5)
  #+end_src

  #+RESULTS:
  : [1] 3.841459
  : [1] 7.814728
  : [1] 11.0705

  For an unbiased dice, it is "unlikely" that $\rv{T}>11.07$. If so
  reject the $\boxed{\H_0: \text{unbiased}}$ hypothesis.
*** A biased dice
#+LaTeX: \small
#+begin_src R :results output :session *R* :exports both
set.seed(44); N = 100; 
X=sample(x=1:6, size = N, prob=c(.16,.16,.16,.16,.16,.2), replace=T)
chisq.test(table(X),p=rep(1/6,times=6))
#+end_src

#+RESULTS:
: 	Chi-squared test for given probabilities
: 
: data:  table(X)
: X-squared = 10.64, df = 5, p-value = 0.059

\vspace{-2em}
#+begin_src R :results output graphics :file "pdf_babel/biased_dice1.pdf" :exports results :width 6 :height 4 :session
plot(factor(X))
#+end_src

#+ATTR_LaTeX: :width .6\linewidth
#+RESULTS:
[[file:pdf_babel/biased_dice1.pdf]]

\vspace{-3em} You cannot reject the hypothesis. And given the samples
and your prior knowledge on the $\overline{\H_0}$, it's probably a good
thing. $\smiley$
*** A biased dice
#+LaTeX: \small
#+begin_src R :results output :session *R* :exports both
set.seed(44); N = 2500; 
X=sample(x=1:6, size = N, prob=c(.16,.16,.16,.16,.16,.2), replace=T)
chisq.test(table(X),p=rep(1/6,times=6))
#+end_src

#+RESULTS:
: 	Chi-squared test for given probabilities
: 
: data:  table(X)
: X-squared = 26.864, df = 5, p-value = 6.063e-05

\vspace{-2em}
#+begin_src R :results output graphics :file "pdf_babel/biased_dice2.pdf" :exports results :width 6 :height 4 :session
plot(factor(X))
#+end_src

#+ATTR_LaTeX: :width .6\linewidth
#+RESULTS:
[[file:pdf_babel/biased_dice2.pdf]]

\vspace{-3em}
26.8! The probability to get such a high value (or higher) is
0.00006. I believe this dice is biased.
*** $\chi^2$ Independance Test
#+begin_src R :results output :session *R* :exports none :var workers=workers
names(workers)=workers[1,]
workers = workers[-1,]
workers = workers[-length(workers[,1]),]
workers = workers[,-length(workers[1,])]
rownames(workers) = workers[,1]
workers = workers[,-1]
workers$A=as.numeric(workers$A)
workers$B=as.numeric(workers$B)
workers$C=as.numeric(workers$C)
workers$D=as.numeric(workers$D)
#+end_src

#+RESULTS:

#+begin_src R :results output :session *R* :exports both
workers
chisq.test(workers) 
#+end_src

#+RESULTS:
:               A  B   C  D
: White collar 90 60 104 95
: Blue collar  30 50  51 20
: No collar    30 40  45 35
: 
: 	Pearson's Chi-squared test
: 
: data:  workers
: X-squared = 24.571, df = 6, p-value = 0.0004098

The probability of getting such a high value (or higher) for $T$ is
0.0004098. This is unlikely, hence I decide to reject the independance
hypothesis.
